---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.GetUpstreamSegments
source: html/7bc0931e-957d-5176-c843-b7d60ed81d9e.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.GetUpstreamSegments Method

Gets all upstream network segments.

## Syntax (C#)
```csharp
public IList<MEPNetworkSegmentId> GetUpstreamSegments()
```

## Returns
The list of segments that flow into this segment.